//WSAD分别是上下左右移动
//每移动一次需要按Enter键一次

#include <stdio.h>
#include <stdlib.h>
#include <windows.h> 
int main()
{
	char a[21][22] = {							 
					"000000000000000000000",
					"0 0 0 0     0     0 0",
					"0 0 0 00000 00000 0 0",
					"0 0               0 0",
					"0 000 000 0 000 0 0 0",
					"0 0     0 0 0   0 0 0",
					"0 0 0 00000 000 000 0",
					"0 0 0     0   0 0    ",
					"0 000 0 0 000 0 0 0 0",
					"0     0 0 0 0 0 0 0 0",
					"0 00000 000 000 0 0 0",
					"0     0       0   0 0",
					"000 0 0 0 000 0 0 0 0",
					"0 0 0 0 0 0   0 0 0 0",
					"0 0000000 0 000 00000",
					"@   0   0 0         0",
					"0 0 0 0 0 00000000000",
					"0 0 0 0             0",
					"000 0 00000 0 000 000",
					"0         0 0   0   0",
					"000000000000000000000" };	//至此迷宫打印完毕 
	int i, x, y, p, q;
	char ch;

	x = 15; y = 0; p = 7; q = 20;
	for (i = 0; i <= 20; i++)
	{
		puts(a[i]);
	}								

	while (x != p || y != q)				
	{
		ch = getchar();						//获取指示操作 

		if (ch == 's')
		{
			if (a[x + 1][y] != '0')		//判断是否可移
			{
				a[x][y] = ' ';
				x++;
				a[x][y] = '@';
			}
		}							              //用户按下's'时,'@'往下移一位  
		else if (ch == 'w')
		{
			if (a[x - 1][y] != '0')		//判断是否可移
			{
				a[x][y] = ' ';
				x--;
				a[x][y] = '@';
			}
		}							               //用户按下'w'时,'@'往上移一位 
		else if (ch == 'a')
		{
			if (a[x][y - 1] != '0')		//判断是否可移
			{
				a[x][y] = ' ';
				y--;
				a[x][y] = '@';
			}
		}							              //用户按下'a'时,'@'往左移一位 
		else if (ch == 'd')
		{
			if (a[x][y + 1] != '0')		//判断是否可移 
			{
				a[x][y] = ' ';
				y++;
				a[x][y] = '@';
			}
		}							             //用户按下'd'时,'@'往右移一位 


		system("cls");			
		for (i = 0; i <= 20; i++)
		{
			puts(a[i]);
		}							//打印'@'移动后的迷宫 
	}
	system("cls");						//清屏操作 
	Sleep(500);
	printf("You win.");				//恭喜你，你赢了 
	Sleep(3 * 1000);
	exit(0);
	system("pause");
	return 0;
}

